<a href="https://colab.research.google.com/github/ustab/NOTES-FROM-LECTURERS/blob/main/DAwPy_S4_(Pandas_DataFrames%2C_Selection_and_Indexing_w_loc%2Ciloc%2C_multi).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 04</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Pandas DataFrames</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [DATA FRAMES](#1)
* [CREATING A DATA FRAME](#2)
    * [Creating a DataFrame Using the Lists of Data & Columns](#2.1)
    * [Creating a DataFrame Using a Numpy Arrays](#2.2)
    * [Creating a DataFrame Using a Dictionary](#2.3)
    * [The Examination of Some Attributes on Data](#2.4)
* [INDEXING, SLICING & SELECTION](#3)    
* [CREATING A NEW COLUMN](#4)    
* [REMOVING COLUMNS](#5)
* [REMOVING ROWS](#6)
* [SELECTING ROWS & COLUMNS USING .loc[ ] & .iloc[ ] ](#7)
* [CONDITIONAL SELECTION](#8)
    * [One Conditional Statement](#8.1)
    * [Two or More Conditional Statements](#8.2)
    * [Conditional Selection Using .loc[ ]](#8.3)
* [reset_index() & set_index()](#9)
* [Multi-Index & Index Hierarchy](#10)
* [Some Other Useful Methods with Iris Dataset](#11)
* [THE END OF THE SESSION-04](#12)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy & Pandas you can import them as a library:

In [ ]:
import pandas as pd
import numpy as np

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Data Frames</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A DataFrame is a two-dimensional data container, similar to a Matrix, but which can contain heterogeneous data, and for which symbolic names may be associated with the rows and columns. ``DataFrames`` are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. 

### Why use Pandas?

Data scientists make use of Pandas in Python for its **following advantages**:

- Easily handles missing data
- It uses Series for one-dimensional data structure and DataFrame for multi-dimensional data structure
- It provides an efficient way to slice the data
- It provides a flexible way to merge, concatenate or reshape the data
- It includes a powerful time series tool to work with

In a nutshell, Pandas is a useful library in data analysis. It can be used to perform data manipulation and analysis. Pandas provide powerful and easy-to-use data structures, as well as the means to quickly perform operations on these structures.

[SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html), 
[SOURCE02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html), 
[SOURCE03](https://morioh.com/p/2528ac775b1b), 
[SOURCE04](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python), 
[SOURCE05](https://www.guru99.com/python-pandas-tutorial.html), 
[SOURCE06](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm), 
[SOURCE07](https://realpython.com/pandas-dataframe/) &
[SOURCE08](https://towardsdatascience.com/a-simple-guide-to-pandas-dataframes-b125f64e1453)<br>
[VIDEO SOURCE01](https://www.youtube.com/watch?v=zmdjNSmRXF4), 
[VIDEO SOURCE02](https://www.youtube.com/watch?v=F6kmIpWWEdU) &
[VIDEO SOURCE03](https://towardsdatascience.com/pandas-dataframe-basics-3c16eb35c4f3)<br>

**Now let's use pandas to explore this topic!**

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a DataFrame</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A **``DataFrame``** is a **two-dimension collection of data**. It is a data structure where data is stored in **tabular form**. Datasets are arranged in rows and columns; we can store multiple datasets in the data frame. We can perform various arithmetic operations, such as adding column/row selection and columns/rows in the data frame.

We can import the DataFrames from the external storage; these storages can be referred to as the SQL Database, CSV file, and an Excel file. We can also use the lists, dictionary, and from a list of dictionary, etc.

In this session, we will learn to create the DataFrame in multiple ways. Let's understand these different ways.

**``pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)``**

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using the Lists of Data & Columns</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
data = [1, 3, 5, 7, 9, 18]
data

[1, 3, 5, 7, 9, 18]

In [ ]:
pd.DataFrame(data, columns=['column1'])

   column1
0        1
1        3
2        5
3        7
4        9
5       18

In [ ]:
pd.Series(data = data, name = "column_1")

0     1
1     3
2     5
3     7
4     9
5    18
Name: column_1, dtype: int64

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Numpy Arrays</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
data = np.arange(1, 24, 2).reshape(3, 4)
data

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [ ]:
df = pd.DataFrame(data=data, columns=['var1','var2','var3','var4'])
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Dictionary</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
s1 = np.random.randint(2, 10, size = 4)
s2 = np.random.randint(3, 10, size = 4)
s3 = np.random.randint(4, 15, size = 4)

In [ ]:
s1

array([5, 9, 2, 5])

In [ ]:
s2

array([3, 4, 5, 7])

In [ ]:
s3

array([ 7,  9,  5, 12])

In [ ]:
myDict= {'var1':s1, 'var2':s2, 'var3':s3}

In [ ]:
df = pd.DataFrame(myDict)
df

   var1  var2  var3
0     5     3     7
1     9     4     9
2     2     5     5
3     5     7    12

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">The Examination of Some Attributes on Data</p>

<a id="2.4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
df.head(2)

   var1  var2  var3
0     5     3     7
1     9     4     9

In [ ]:
df.tail(2)

   var1  var2  var3
2     2     5     5
3     5     7    12

In [ ]:
df.sample(2)

   var1  var2  var3
3     5     7    12
2     2     5     5

In [ ]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [ ]:
for i in df.columns:
    print(i)

var1
var2
var3

In [ ]:
for i in df.columns:
    print(df[i].mean())

5.25
4.75
8.25

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
[i for i in df.index]

[0, 1, 2, 3]

In [ ]:
df.columns=['new1', 'new2', 'new3']
df

   new1  new2  new3
0     5     3     7
1     9     4     9
2     2     5     5
3     5     7    12

In [ ]:
df.index = ["a", "b", "c", "d"]
df

   new1  new2  new3
a     5     3     7
b     9     4     9
c     2     5     5
d     5     7    12

In [ ]:
df.rename(columns={"new1": "a", "new2": "b"})

   a  b  new3
a  5  3     7
b  9  4     9
c  2  5     5
d  5  7    12

In [ ]:
df.rename(index={"a": 1, "b": 2})

   new1  new2  new3
1     5     3     7
2     9     4     9
c     2     5     5
d     5     7    12

In [ ]:
df

   new1  new2  new3
a     5     3     7
b     9     4     9
c     2     5     5
d     5     7    12

In [ ]:
df.shape

(4, 3)

In [ ]:
df.shape[0]

4

In [ ]:
len(df)

4

In [ ]:
df.ndim

2

In [ ]:
df.size

12

In [ ]:
df.values

array([[ 5,  3,  7],
       [ 9,  4,  9],
       [ 2,  5,  5],
       [ 5,  7, 12]])

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
type(df.values)

numpy.ndarray

In [ ]:
type(df["new1"])

pandas.core.series.Series

In [ ]:
# we can check any column name whether it belongs to the DataFrame or not

"new2" in df

True

In [ ]:
'new5' in df

False

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Indexing, Slicing & Selection</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's learn a variety of methods to grab data from a DataFrame

In [ ]:
from numpy.random import randn

In [ ]:
# creating a DataFrame by "keyword arguments"

np.random.seed(101)
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [ ]:
# SQL Syntax (NOT RECOMMENDED!)

df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [ ]:
type(df['Y'])

pandas.core.series.Series

In [ ]:
df[['Y']]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [ ]:
type(df[['Y']])

pandas.core.frame.DataFrame

In [ ]:
#df['Z','X'] gives error

In [ ]:
# it searches index to find ["X" : "Y"]

df["X":"Z"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [ ]:
df['B':'D']

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
#df['C','D'] gives error

In [ ]:
df["A":"C"][["Y", "Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a New Column</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# feature engineering OR feature extraction

df['new1'] = df['X'] * df['Y']
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [ ]:
df["new2"] = np.arange(5)
df

          W         X         Y         Z      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577     4

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Columns</p>

<a id="5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
df.drop('new2', axis=1)

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [ ]:
df

          W         X         Y         Z      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577     4

In [ ]:
df.drop(["new1", "new2"], axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          W         X         Y         Z      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577     4

In [ ]:
df.drop(columns = ["new1", "new2"])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# It will NOT be permanent (inplace=True), unless specified!

df.drop(["new1", "new2"], axis=1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Rows</p>

<a id="6"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
df.drop('C', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop(index=['B'])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# the default value of axis is 0 (axis = 0)

df_temp = df.drop('C', axis=0)
df_temp

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Selecting Rows and Columns using .loc[ ] and iloc[ ]</p>

<a id="7"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

#### `.loc[]`  allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]`  allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [ ]:
data = np.random.randint(1, 40, size=(8, 4))

df = pd.DataFrame(data, columns = ["var1", "var2", "var3", 'var4'])
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [ ]:
df.loc[4]

var1    20
var2    36
var3    31
var4    11
Name: 4, dtype: int32

In [ ]:
df.loc[[4]]

   var1  var2  var3  var4
4    20    36    31    11

In [ ]:
# Slicing produces the same type of the data. Here, DataFrame

df.loc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23

In [ ]:
df.iloc[2:5]

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11

In [ ]:
df.index = 'a b c d e f g h'.split()
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [ ]:
df.iloc[1:4]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37

In [ ]:
# df.loc[1:4]  # gives error

In [ ]:
df.loc['c':'g']

   var1  var2  var3  var4
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23

In [ ]:
df.loc['d','var3']

25

In [ ]:
df.iloc[3, 2]

25

In [ ]:
df.loc['d':'g', 'var2']

d    30
e    36
f    28
g    24
Name: var2, dtype: int32

In [ ]:
df.loc['d':'g']['var3']

d    25
e    31
f     9
g    38
Name: var3, dtype: int32

In [ ]:
# how can we select these data as a DataFrame not a series
# First way

df.loc['d':'g'][['var3']]

   var3
d    25
e    31
f     9
g    38

In [ ]:
# Second way

df.loc['d':'g', ["var3"]]

   var3
d    25
e    31
f     9
g    38

In [ ]:
df.loc['d':'g'][["var2","var3"]]

   var2  var3
d    30    25
e    36    31
f    28     9
g    24    38

In [ ]:
df.iloc[2:5, 2]

c    12
d    25
e    31
Name: var3, dtype: int32

In [ ]:
df.iloc[2:5, [2]]

   var3
c    12
d    25
e    31

In [ ]:
#df.iloc[2:5][[2]] gives error

In [ ]:
df.iloc[2:5][['var3']]

   var3
c    12
d    25
e    31

In [ ]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [ ]:
df.loc['a','var1']

8

In [ ]:
# let's select the same data as a DataFrame

df.loc[['a'], ['var1']]

   var1
a     8

In [ ]:
df.loc[['a','c'],['var1','var3']]

   var1  var3
a     8    39
c    13    12

In [ ]:
df.iloc[[0, 2], [0, 2]]

   var1  var3
a     8    39
c    13    12

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Conditional Selection</p>

<a id="8"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [ ]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">One Conditional Statement</p>

<a id="8.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
# returns a DataFrame consists of bool type

df > 10

    var1   var2   var3   var4
a  False   True   True  False
b   True  False   True  False
c   True   True   True   True
d   True   True   True   True
e   True   True   True   True
f   True   True  False   True
g   True   True   True   True
h  False  False   True   True

In [ ]:
df[df > 10]

   var1  var2  var3  var4
a   NaN  11.0  39.0   NaN
b  19.0   NaN  16.0   NaN
c  13.0  18.0  12.0  16.0
d  34.0  30.0  25.0  37.0
e  20.0  36.0  31.0  11.0
f  21.0  28.0   NaN  23.0
g  27.0  24.0  38.0  23.0
h   NaN   NaN  19.0  29.0

In [ ]:
# It returns based on rows.

df[df['var1'] > 10]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23

In [ ]:
df[df['var1'] > 10]['var2']

b     8
c    18
d    30
e    36
f    28
g    24
Name: var2, dtype: int32

In [ ]:
df[df['var1'] > 10][['var2']]

   var2
b     8
c    18
d    30
e    36
f    28
g    24

In [ ]:
# how can we select the data as a DataFrame

df[df['var1'] > 10][['var2', "var3"]]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Two or More Conditional Statements</p>

<a id="8.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**For two or more conditions, you can use |  or, &  and with parenthesis:**

In [ ]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [ ]:
df[(df['var1'] > 10) & (df['var1'] < 20)]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16

### <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Conditional Selection Using .loc[ ] and .iloc[ ]</p>

<a id="8.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [ ]:
df.loc[(df["var1"] > 10), ['var2', 'var3']]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

In [ ]:
df.loc[((df["var1"] < 10) | (df["var1"] > 30)), ['var2','var3']]

   var2  var3
a    11    39
d    30    25

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">reset_index() & set_index()</p>

<a id="9"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [ ]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [ ]:
# Reset to default 0, 1...n index

df.reset_index()

  index  var1  var2  var3  var4
0     a     8    11    39    10
1     b    19     8    16     1
2     c    13    18    12    16
3     d    34    30    25    37
4     e    20    36    31    11
5     f    21    28     9    23
6     g    27    24    38    23
7     h    10     3    19    29

In [ ]:
df.reset_index(drop=True)

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [ ]:
df.reset_index(drop=True, inplace=True)
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [ ]:
df.set_index('var4')

      var1  var2  var3
var4
10       8    11    39
1       19     8    16
16      13    18    12
37      34    30    25
11      20    36    31
23      21    28     9
23      27    24    38
29      10     3    19

In [ ]:
df.set_index('var4', inplace=True)
df

      var1  var2  var3
var4
10       8    11    39
1       19     8    16
16      13    18    12
37      34    30    25
11      20    36    31
23      21    28     9
23      27    24    38
29      10     3    19

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Multi-Index & Index Hierarchy</p>

<a id="10"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels

outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [ ]:
hier_index = pd.MultiIndex.from_tuples(multi_index)
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [ ]:
np.random.seed(101)
df = pd.DataFrame(np.random.randn(9, 4), index = hier_index, columns=['A', 'B', 'C', 'D'])
df

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502
      6    0.807706  0.072960  0.638787  0.329646
      7   -0.497104 -0.754070 -0.943406  0.484752

**``Note``** that all of the MultiIndex constructors accept a names argument which stores string names for the levels themselves. If no names are provided, None will be assigned:

For more information Indexing and Selecting Data, visit [**Pandas Official Documentation**](https://pandas.pydata.org/pandas-docs/version/0.13.0/indexing.html)

In [ ]:
df.index.names

FrozenList([None, None])

In [ ]:
df.index.names = ['Group', 'Num']
df.index.names

FrozenList(['Group', 'Num'])

In [ ]:
df

                  A         B         C         D
Group Num
M1    1    0.903319  1.543568  3.014676 -0.139170
      2    0.482311  0.977939 -0.344431 -1.785068
      3    0.530949  0.628364  2.283261  0.148912
M2    1    0.536175  0.144883 -0.627879  1.151898
      2    0.259370 -1.186527 -0.673861 -1.555119
      3   -0.566604 -0.790608  0.230762  1.028012
M3    5   -0.888242 -2.141687 -0.976076  1.414672
      6   -1.562469 -0.676467 -1.617897 -1.818591
      7    0.171447  0.377750  1.049934 -0.526008

In [ ]:
df.index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           names=['Group', 'Num'])

In [ ]:
df.index.levels

FrozenList([['M1', 'M2', 'M3'], [1, 2, 3, 5, 6, 7]])

In [ ]:
df.index.get_level_values(0)

Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

In [ ]:
df.index.get_level_values("Group")

Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

In [ ]:
df[["A"]]

                  A
Group Num
M1    1    0.903319
      2    0.482311
      3    0.530949
M2    1    0.536175
      2    0.259370
      3   -0.566604
M3    5   -0.888242
      6   -1.562469
      7    0.171447

In [ ]:
df[["A","B"]]

                  A         B
Group Num
M1    1    0.903319  1.543568
      2    0.482311  0.977939
      3    0.530949  0.628364
M2    1    0.536175  0.144883
      2    0.259370 -1.186527
      3   -0.566604 -0.790608
M3    5   -0.888242 -2.141687
      6   -1.562469 -0.676467
      7    0.171447  0.377750

In [ ]:
df.loc['M1']

            A         B         C         D
Num
1    0.903319  1.543568  3.014676 -0.139170
2    0.482311  0.977939 -0.344431 -1.785068
3    0.530949  0.628364  2.283261  0.148912

In [ ]:
df.loc[("M1", 2)]

A    0.651118
B   -0.319318
C   -0.848077
D    0.605965
Name: (M1, 2), dtype: float64

In [ ]:
df.loc[[("M1", 2)]]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965

In [ ]:
df.loc["M1", "A":"C"]

            A         B         C
Num
1    0.903319  1.543568  3.014676
2    0.482311  0.977939 -0.344431
3    0.530949  0.628364  2.283261

In [ ]:
df.loc[[("M1", 2)], "A":"C"]

                  A         B         C
Group Num
M1    2    0.651118 -0.319318 -0.848077

In [ ]:
df.loc["M1":"M2"]

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

In [ ]:
df.loc[("M1", 2):("M2", 3)]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

In [ ]:
df.loc[("M1", 2): "M2"]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

In [ ]:
df.loc[[("M2", 3), ("M3", 5)]]

                  A         B         C         D
Group Num
M2    3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502

More information for Multiindex and Advanced Indexing, visit [**Pandas Official Documentation**](https://pandas.pydata.org/docs/user_guide/advanced.html)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Some Other Useful Methods with Iris Dataset</p>

<a id="11"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

### Let's apply functions/attributes/methods we have learnt for "iris dataset"

In [ ]:
import seaborn as sns

In [ ]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'taxis',
 'tips',
 'titanic']

In [ ]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df.shape

(150, 5)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
df.sample(4)

     sepal_length  sepal_width  petal_length  petal_width     species
138           6.0          3.0           4.8          1.8   virginica
83            6.0          2.7           5.1          1.6  versicolor
126           6.2          2.8           4.8          1.8   virginica
28            5.2          3.4           1.4          0.2      setosa

In [ ]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
# df.describe().T

df.describe().transpose()

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [ ]:
df.describe(include="all")

# "number" and "object" can be used as include/exclude parameter

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [ ]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [ ]:
df.corr()[["sepal_length"]]

              sepal_length
sepal_length      1.000000
sepal_width      -0.117570
petal_length      0.871754
petal_width       0.817941

In [ ]:
df['petal_length'].corr(df["petal_width"])

0.9628654314027963

In [ ]:
df.species.value_counts(dropna=False)

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [ ]:
df['species'].value_counts(dropna=False, normalize=True)

setosa        0.333333
versicolor    0.333333
virginica     0.333333
Name: species, dtype: float64

In [ ]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [ ]:
df.species.nunique()

3

In [ ]:
df.loc[df["species"] == "setosa", "sepal_length"]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [ ]:
df[(df.sepal_length > 4) & (df.sepal_length < 5)]

     sepal_length  sepal_width  petal_length  petal_width     species
1             4.9          3.0           1.4          0.2      setosa
2             4.7          3.2           1.3          0.2      setosa
3             4.6          3.1           1.5          0.2      setosa
6             4.6          3.4           1.4          0.3      setosa
8             4.4          2.9           1.4          0.2      setosa
9             4.9          3.1           1.5          0.1      setosa
11            4.8          3.4           1.6          0.2      setosa
12            4.8          3.0           1.4          0.1      setosa
13            4.3          3.0           1.1          0.1      setosa
22            4.6          3.6           1.0          0.2      setosa
24            4.8          3.4           1.9          0.2      setosa
29            4.7          3.2           1.6          0.2      setosa
30            4.8          3.1           1.6          0.2      setosa
34            4.9          3.1           1.5          0.2      setosa
37            4.9          3.6           1.4          0.1      setosa
38            4.4          3.0           1.3          0.2      setosa
41            4.5          2.3           1.3          0.3      setosa
42            4.4          3.2           1.3          0.2      setosa
45            4.8          3.0           1.4          0.3      setosa
47            4.6          3.2           1.4          0.2      setosa
57            4.9          2.4           3.3          1.0  versicolor
106           4.9          2.5           4.5          1.7   virginica

In [ ]:
df[(df.species == "virginica") & (df.sepal_length > 4)  & (df.sepal_length < 5)]

     sepal_length  sepal_width  petal_length  petal_width    species
106           4.9          2.5           4.5          1.7  virginica

In [ ]:
df.sort_values(by='sepal_length', ascending=True)

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of The Session - 04</p>

<a id="12"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

________